# TextBox Events

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TextBox Events
TextBox Class See Also
---
The TextBox type exposes the following members.
# Events
| Name | Description |
| --- | --- |
| --- | --- | --- |
| EnterPressed | Subscribe to this event to be notified when the Enter button is pressed in the text box. |

# See Also
TextBox Class
Autodesk.Revit.UI Namespace